app/controllers/items_controller.rb

SELECT "items".* FROM "items"  ORDER BY created_at DESC
---
  def index
      @items = Item.all.order("created_at DESC")

INSERT INTO "items" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hausi machen"], ["description", "test"], ["created_at", "2018-09-15 18:57:55.690848"], ["updated_at", "2018-09-15 18:57:55.690848"]]
---
  def create
      @items = Item.new(item_params)
      if @items.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "items" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["title", "Hausi machen-Lingo"], ["description", "Abgeben!"], ["updated_at", "2018-09-15 19:26:17.028821"], ["id", 2]]
---
  def update
      @item = Item.find(params[:id])
      if @item.update(item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "items" SET "completed_at" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["completed_at", "2018-09-16 07:22:22.388435"], ["updated_at", "2018-09-16 07:22:22.389413"], ["id", 7]]
---
  def complete
      @item = Item.find(params[:id])
      @item.update_attribute(:completed_at, Time.now)